Revit 2024 API
BuiltInFailures.ConnectorFailures.UnconnectedDevice Property
 Device has an unconnected [Type Name] connector (index = [Index Number]).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId UnconnectedDevice { get; }
Visual Basic
Public Shared ReadOnly Property UnconnectedDevice As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ UnconnectedDevice {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace